---
kind: type
id: T:Autodesk.Revit.DB.DatumEnds
source: html/60cdd5d4-8c6c-320b-7b8b-1cc4487edd9c.htm
---
# Autodesk.Revit.DB.DatumEnds

An enumerated type representing ends of a datum plane.

## Syntax (C#)
```csharp
public enum DatumEnds
```